// ให้สร้าง Function printPattern Function นี้จะรับตัวเลขเข้ามา 1 ตัว แล้วแสดงผลลัพธ์ตามตัวเลขที่ได้รับมา เช่น ถ้าตัวเลขที่รับมาคือ 5
// - แต่ละแถวจะแสดงตัวเลขเรียงกันตั้งแต่ 1 ไปจนถึงหมายเลขแถว เช่น แถวที่ 1 จะนับถึงแค่ 1 แถวที่ 5 จะนับตั้งแต่ 1-5
// - จำนวนแถวจะเท่ากับตัวเลขที่รับเข้ามา (ในกรณีนี้คือ 5)
// - Function นี้ต้องสามารถทำงานได้กับตัวเลขที่แตกต่างกัน เช่น
//     - ถ้าใส่เลข 3 ก็จะได้ 3 แถว
//     - ถ้าใส่เลข 10 ก็จะได้ 10 แถว
// เริ่มเขียนโค้ดตรงนี้ 
function printPattern(n) {
    let finalResult = "";
    for (let i = 1; i <= n; i++) {
      let rowResult = ""; // รวบค่าจากการวน Loop ภายใน
      for (let j = 1; j <= i; j++) {
        rowResult += j + "\t";
      }
      finalResult += rowResult + "\n";
    }
    return finalResult;
  }
  
  console.log(printPattern(5));


  